test/fixtures/cancel_invoice.json

{
  "id": "inv_6vRZmJYFAG1mNq",
  "entity": "invoice",
  "receipt": null,
  "invoice_number": null,
  "customer_id": "cust_6vRXClWqnLhV14",
  "customer_details": {
    "customer_name": null,
    "customer_email": "test@razorpay.com",
    "customer_contact": "9876543210",
    "customer_address": null
  },
  "order_id": "order_6vRZmJu7EPEMY0",
  "line_items": [],
  "payment_id": null,
  "expire_by": null,
  "status": "cancelled",
  "issued_at": 1482299421,
  "paid_at": null,
  "cancelled_at": 1482299424,
  "expired_at": null,
  "sms_status": "sent",
  "email_status": "sent",
  "date": 1482299421,
  "partial_payment": false,
  "terms": null,
  "gross_amount": 100,
  "tax_amount": 0,
  "amount": 100,
  "amount_paid": 100,
  "amount_due": 0,
  "description": "Test description",
  "notes": [],
  "currency": "INR",
  "short_url": "http://bit.ly/2i8kSqu",
  "comment": null,
  "view_less": true,
  "type": "invoice",
  "billing_start": null,
  "billing_end": null,
  "group_taxes_amounts": false,
  "user_id": "fake_user_id",
  "created_at": 1482299422
}
